{"email": "placeholderemail1@email.com", "linkedin_url": "https://www.linkedin.com/in/marcinwaryszak/", "name_surname": "Marcin Waryszak", "organization": "not found", "description": "Children's Mental Health | Forbes 25u25 | 🔴TEDx Speaker | Sigma² Fellow | 2x Founder of Impact-driven Ventures", "posts": ["Children's Hospitals Decision Makers, Public Administration, Physicians... and I 😎... working together on ways of introducing paediatric innovations into healthcare systems around Europe 🌐 \n\nHealth innovation often leans towards focusing on the elderly rather than the young, and investments in paediatrics lag behind those for adults, despite significant untapped potential.\n\n👉 Is that a problem?\n👉 Yes and no...\n👉 In fact, Innovation should encompass ALL age groups...\n\nWith deep conviction, I accepted the invitation fromand had the honour to work as one of the few, highly selected decision-makers from leading European institutions, dedicating ourselves directly to addressing this challenge.\n\nOver the past few weeks, I have collaborated in insightful workshops with esteemed partners such asfrom Spain,from Poland, Rigshospiralet from Denmark, Children's Clinical University Hospital from Latvia,,from Finland,,, and others, to develop innovative solutions for paediatric healthcare in Europe.\n\nWe've identified key barriers and gaps hindering advancements in paediatric health, including:\n🔺 Financial, regulatory, and commercial adoption barriers\n🔺 Human capital and infrastructural challenges\n🔺 Limited networks and collaborations\n🔺 Geographical disparities\n🔺 Cultural and incentive issues\n\nBut we didn't stop there ❗ Through engaging with 🔹hundreds of experts🔹 and brainstorming sessions, we've formulated solutions and recommendations to address these challenges.\n\n- The results of our collaborative efforts will be published soon! -\n\n🔔 Follow me to stay updated and be part of this journey; stay tuned for more updates.", "🏖 Let me share a tale of seaside delight,\n📅 It happened last Saturday, sunny and bright.\n🎒 I packed my bag, ready to explore,\n🧢 Placed my cap, eager for more.\n🚂 Boarded the train to Gdańsk, a city of charm,\n☕ With a coffee in hand, I set out with calm.\n🏙 Through bustling streets, I made my way,\n🛍 To the Forum shopping center, a place to stay.\n🤯 Surprisingly, no purchases made.\n\n❓ Why ❓\n\nA shopping center is a spot where you'll find people from all walks of life. Rich, poor, young, old. Some know a lot about mental health, while others still see depression as just a phase of youth.\n\nMy trip had a hidden agenda - a concert promoting awareness of children's and adolescents' mental health (by FOSA Foundation). I joined forces with social activist, and together we delivered a speech on future technologies and their impact on our psyche.\n\nI often discuss mental health, even here on LinkedIn. However, it usually reaches the same audience. ❗ You ❗ Those reading this text right now. Founders, investors, journalists, employees of large corporations... Does this group need such education? Still, yes. However, it's still a kind of information bubble. If we want to be effective (and that's what it's all about), we need to step out of it and reach out to a wider audience.\n\nAnd to truly influence public awareness, we need to engage various stakeholders - governments, foundations and associations, media, but also work organically, at the grassroots level.\n\nI think I don't have any call to action here, but I just wanted to share my piece of art..\n\n________\n\n\n\nPS Yes! There is no sound. You need to come to the next events and listen 😈", "Saturday at ĀRYA Accelerate's demo day was a reminder of why ventures like ours at Calmsie and those pioneering at ĀRYA Foundry matter deeply. Calmsie joined the event as special guests.\n\nWitnessing the dedication to impactful innovation was not just inspiring—it was a call to action.🥇 , with their cutting-edge health solutions, and🥇, pioneering in sustainability and environmental health are just the examples.\n\nWhy Impact-Driven Ventures Matter:\n🔹 They tackle critical global issues head-on, innovating for the planet and its people.\n🔹 Their growth is measured not just in revenue, but in sustainable, positive change.\n🔹 They inspire, proving business can flourish alongside societal and environmental well-being.\n\nYet, the Path is Fraught with Challenges:\n🔸 Balancing profit with purpose is a delicate dance.\n🔸 The problems are complex, demanding not just solutions, but systemic change.\n🔸 Finding aligned funding is tough but essential.\n\nIt’s a tough journey, blending business with positive impact, but the ventures showcased on Saturday prove it's possible—and necessary.\n\nĀRYA Team (led by👏 ), your work is the blueprint for the future we're all striving to build.\n\n___________________\n\n🔽🔽🔽\n,();,();,,,,();,,,(),(),,,(\n) - your passion, innovation, and resilience left us in awe. The future is now 🚀🚀🚀", "Guess who's borrowing a bit of unicorn magic? 🧙‍♂️\n\nCalmsie received a grant from 1️⃣1️⃣ ElevenLabs, which means we're on track to integrate their top-notch text-to-speech tech with our platform. Been a fan of their work and really looking forward to seeing how their 🧚‍♀️ pixie dust 🧚‍♀️ elevates what we do for kids..\n\n_____", "CHILDREN'S HEALTH + STARTUPS = The biggest missed opportunity (in Israel).\n\nVery recently I had the incredible honor of hostingfrom,from, andfromfor a special panel on the role that startups and tech can play in improving healthcare for children.\n\nSafe to say this was one of the best panels I have ever participated in, with incredible content and three brilliant participants.\n\nI encourage anybody who is familiar with the space to read (and share!) my Summary Report linked below, and to check out a video of the wonderful session here:\n\n\n\n\nHat tip to"]}