{"email": "placeholderemail2@email.com", "linkedin_url": "https://www.linkedin.com/in/mariuszgil/", "name_surname": "Mariusz Gil", "organization": "Volt.io", "description": "Head of Software Architecture", "posts": ["Zostały ostatnie miejsca na intensywny EventStorming w przyszłym tygodniu :) Jeśli chcesz zacząć stosować tę technikę z zespołem w projekcie, łączyć ją z podejściem Domain-Driven Design, zapraszam! Szczegóły poniżej.", "Zapraszam na to spotkanie, okazja 2 lat Gildii ES w Allegro konkretna 😀 Będzie można też konkretnie, ale na luzie porozmawiać na różne dev-tematy.\n\nKudos dlai teamu za organizację 🔥", "Jeśli wycena projektu podawana jest w dwóch wersjach, z uwzględnieniem testów i bez, to z software craftsmanshipem ma to niewiele wspólnego. To tak, jakby pytać chirurga, czy może przyspieszyć operację nie dezynfekując skalpela. Jakość nie powinna być elementem przetargowym.\n\nAle wiadomo, są wyjątki od reguł, bo czasem pracujemy po prostu nad proof-of-concept i potrzebujemy tylko zweryfikować naszą wizję. Inna sprawa, że taki prototyp ląduje często na produkcji i tam wygrzewa się w testach na użytkownikach końcowych. Klasyczne protoduction....\n\nJak pisać wartościowe testy, które realnie sprawdzają zachowania systemu, a nie same mocki, jak nawigować po szarej strefie testów Kevlina Henney'a, dlaczego unit to więcej niż klasa czy metoda i jakie lessons-learned wynieśliśmy z wielu projektów - to tylko niektóre tematy, które poruszamy dziś w Better Software Design z.\n\nMam nadzieję, że wnioski z tej rozmowy zapadną głęboko w pamięć, bo naprawdę warto 🔥 Link tradycyjnie w komentarzu...", "W Better Software Design rozmawialiśmy już o testach, o froncie, dziś zapraszam na rozmowę o testowaniu systemu od frontu 😀 \n\nMoim gościem jest dziś, pracujący na co dzień jako Senior Quality Assurance Engineer w. A rozmawiać będziemy nie tylko i testach end-to-end systemu czy Playwright, ale także o tym, jaką rolę QA pełni w projekcie i dlaczego QA warto czasem przetłumaczyć jako Questions Asker.\n\nLink do rozmowy w komentarzu.", "W ubiegłą niedzielę, tuż po konferencji Boiling Frogs 🐸, spotkaliśmy się wraz z Mariusz Gil w jego wrocławskim studiu nagrań pogadać o szeroko rozumianym zapewnieniu jakości oprogramowania, testowaniu, pracy w firmie produktowej takiej jak, czy podejściu do automatyzacji testów E2E. Nie zabrakło też wątku o narzędziach, rywalizacjivsczy podejściu do stabilizacji testów.\n\nCo z tego wyszło? Po co w ogóle testować? 🤔 Już jutro przekonacie się w kolejnym odcinku podcastu👈\n\nStay tuned!"]}